# Обращаемся к библиотеке "random", чтобы было интереснее
import random

# Компьютер "Загадывает число" от 1 до 100
num = random.randint(1, 100)

# Пока пользователь не угадает, программа не остановиться
while True:

    # Защита от опечаток
    try:
        n = int(input("Угадай число: "))

        if n == num:
            print("Вы угадали! 0_0")
            break
        elif n > num:
            print("Мое число меньше))))))")
        else:
            print("Мое число больше))))))")

    except ValueError:           # :)))))))))))
        print("Уверен, что это число???")
