#include <iostream>

int main() {
  // Создаю переменные и задаю ей значение
  int num;
  std::cout << "\nВведите число на проверку: ";
  std::cin >> num;

  // Проверяем, четное число или нет
  if (num % 2 == 0) {
    std::cout << "Ваше число - четное";
  } else {
    std::cout << "Ваше число - нечетное";
  }

  // (ДОП) Проверяем крастность на 3
  std::cout << "\n";
  if (num % 3 == 0) {
    std::cout << "Ваше число делится на 3";
  } else {
    std::cout << "Ваше число не делится на 3";
  }

  // Проверяем положительное число, отрицательное или 0
  std::cout << "\n";
  if (num > 0) {
    std::cout << "Ваше число положительное";
  } else if (num < 0) {
    std::cout << "Ваше число отрицательное";
  } else {
    std::cout << "Ваше число - 0";
  }

  return 0;
}
