#include <iostream>

int main() {
  // Создаю переменные и запрашиваю их значения
  double a, b, c;

  std::cout << "1 сторона: ";
  std::cin >> a;

  std::cout << "2 сторона: ";
  std::cin >> b;

  std::cout << "3 сторона: ";
  std::cin >> c;

  // Проверяю есть ли такой треугольник или нет
  if ((a + b > c) and (a + c > b) and (b + c > a)) {
    // Если есть, то вывожу его тип
    if (a == b == c) {
      std::cout << "Треуг. равносторонний";
    } else if ((a == b) or (a == c) or (b == c)) {
      std::cout << "Треуг. равнобедренный";
    } else {
      std::cout << "Треуг. разносторонний";
    }
  }

  // Если нет, то вывожу, что его нет
  else {
    std::cout << "Такого треуг. не существует!!!";
  }

  return 0;
}
