# Запрашиваю значения сторон треуг.
a = float(input('1 сторона: '))
b = float(input('2 сторона: '))
c = float(input('3 сторона: '))

# Проверяю есть ли такой треуг. или нет
if a + b > c and a + c > b and b + c > a:

    # Если есть, вывожу его тип
    if a == b == c:
        print("Равносторонний")
    elif a == b or a == c or b == c:
        print("Равнобедренный")
    else:
        print("Разносторонний")
# Если такого нет, вывожу соответствующий результат
else:
    print("Такого треугольника нет!")

